; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image2 - mode
	image8 - mode
	infrared3 - mode
	thermograph0 - mode
	spectrograph6 - mode
	image9 - mode
	infrared7 - mode
	thermograph4 - mode
	image1 - mode
	thermograph5 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image8)
	(supports instrument0 thermograph5)
	(supports instrument0 image1)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared7)
	(supports instrument0 image9)
	(supports instrument0 spectrograph6)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Star6 thermograph5)
	(have_image Star6 thermograph4)
	(have_image Star6 image1)
	(have_image Planet7 image8)
	(have_image Planet8 infrared7)
	(have_image Phenomenon9 image8)
	(have_image Planet10 thermograph0)
	(have_image Planet10 image8)
	(have_image Planet10 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 0 of 9
5. (take_image satellite0 planet7 instrument0 image8)
   added: (have_image planet7 image8)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon9 instrument0 image8)
   added: (have_image phenomenon9 image8)
   goals met: 2 of 9
8. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 2 of 9
9. (take_image satellite0 planet10 instrument0 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 3 of 9
10. (take_image satellite0 planet10 instrument0 image8)
   added: (have_image planet10 image8)
   goals met: 4 of 9
11. (take_image satellite0 planet10 instrument0 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 5 of 9
12. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 5 of 9
13. (take_image satellite0 planet8 instrument0 infrared7)
   added: (have_image planet8 infrared7)
   goals met: 6 of 9
14. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   goals met: 6 of 9
15. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 7 of 9
16. (take_image satellite0 star6 instrument0 thermograph4)
   added: (have_image star6 thermograph4)
   goals met: 8 of 9
17. (take_image satellite0 star6 instrument0 thermograph5)
   added: (have_image star6 thermograph5)
   goals met: 9 of 9
